bench/results/java25/20260424T101307Z/load.stdout.txt
{"ok": true, "tool": "wrk", "url": "http://localhost:8080/api/gateway/orders", "method": "GET", "duration_s": 120, "warmup_s": 60, "concurrency": 25, "threads": 4, "body_file": null, "header_file": null, "requests_per_sec": 3754.29, "p50": "6.00ms", "p95": "12.05ms", "p99": "14.70ms", "http_non2xx": "na", "socket_errors": {}, "raw_excerpt": "Running 2m test @ http://localhost:8080/api/gateway/orders\n  4 threads and 25 connections\n  Thread Stats   Avg      Stdev     Max   +/- Stdev\n    Latency     6.47ms    2.80ms  76.59ms   82.03%\n    Req/Sec     0.94k   140.21     1.34k    68.21%\n  Latency Distribution\n     50%    6.00ms\n     75%    7.57ms\n     90%    9.41ms\n     99%   14.70ms\n  450843 requests in 2.00m, 102.76MB read\nRequests/sec:   3754.29\nTransfer/sec:      0.86MB"}